Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/motoring_1/driving_offences/driving_offences.html.txt.tmx
Source language: en
Languages: ga

source: Penalty points and endorsements on driving licences acquired in other countries (including EU/EEA member states) are not recognised between states
ga: Ní aithnítear idir ballstáit pointí pionóis agus droimscríobhanna ar cheadúnais tiomána a fuarthas i dtíortha eile (lena n-áirítear Ballstáit an tAE/LEE)

source: Although a European Convention on driving disqualifications was signed by the member states in June of 1998 which allowed making certain disqualification effective throughout the EU, the Convention has not yet come into force
ga: Cé gur shínigh na ballstáit Coinbhinsiún Eorpach maidir le dícháiliú tiomána i Meitheamh 1998, a thug éifeacht le dícháiliú áirithe ar fud an AE, níor tháinig an Coinbhinsiún i bhfeidhm go fóill

source: In practice therefore, this means if you acquired penalty points or have endorsements on your driving licence before coming to Ireland, these penalty points or endorsements will not transfer over to an Irish driving licence
ga: I gcleachtas, ar an ábhar sin, ciallaíonn seo má fhaigheann tú pointí pionóis nó má tá droimscríobhanna agat ar do cheadúnas tiomána sula dtéann tú go hÉirinn, ní aistreofar na pointí pionóis nó na droimscríobhanna seo chuig ceadúnas tiomána Éireannach

source: If, however, you have been disqualified from driving in another country and this was in addition to a prison sentence for driving offences it may not be possible for you to exchange your full foreign driving licence for a full driving licence here in Ireland
ga: Má dícháilíodh thú, áfach, ó thiomáint i dtír eile agus go raibh seo anuas ar thréimhse phríosúnachta do chionta tiomána, d’fhéadfadh nach mbeifeá in ann do cheadúnas iomlán eachtrach tiomána a aistriú do cheadúnas iomlán tiomána anseo in Éirinn

source: Mutual recognition of driving disqualifications between Ireland and the UK (including Norther Ireland) came into operation from 28 January 2010
ga: Tháinig comhaitheantas dícháiliú tiomána idir Éirinn agus an RA (lena n-áirítear Tuaisceart Éireann) i bhfeidhm ón 28 Eanáir 2010

source: It does not include disqualifications resulting from the accumulation of penalty points
ga: Ní áirítear dhícháilíochtaí mar thoradh ar an carnadh na pointí pionóis

source: Driving on a foreign licence in Ireland
ga: Ag tiomáint ar cheadúnas eachtrannach in Éirinn

source: If you are driving on a foreign driving licence in Ireland and acquire penalty points here, a record will be created and the points added to the record
ga: Má tá tú ag tiomáint agus má tá ceadúnas tiomána iasachta agat in Éirinn agus má ghearrtar pointí pionóis ort anseo, cruthófar taifead agus cuirfear na pointí leis an taifead

source: If you accumulate 12 penalty points on the record in a 3-year period you will be disqualified from driving in Ireland
ga: Má bhailíonn tú 12 phointe pionóis ar an taifead i dtréimhse 3 bliana, dícháileofar thú ó thiomáint in Éirinn

source: Appeals to the Circuit Court to reverse a conviction leading to disqualification from driving are free of charge
ga: Tá achomhairc leis an gCúirt Chuarda d’fhonn ciontú a fhreaschur as a n-eascraíonn dícháiliú ó thiomáint saor in aisce

source: Appeals to the District Court for the early restoration of your driving license if you are disqualified cost €55
ga: Cosnaíonn achomhairc leis an gCúirt Dúiche d’athbhronnadh do cheadúnais tiomána má dícháilíodh thú €55

source: All fines and fees collected by the Gardaí or authorised persons are paid to the state unless otherwise stated in the law
ga: Íoctar an uile fhíneáil a bhailíonn an Garda Síochána nó daoine údaraithe leis an stát mura luaitear a mhalairt sa dlí

source: A copy of your driving licence record from the NDLS costs €15
ga: Tá cóip de do thaifead ceadúnais tiomána ó an NDLS € 15

source: If you have been convicted of motoring offences and disqualified from driving in a District Court, you can appeal the disqualification to the Circuit Court
ga: Má ciontaíodh thú i leith cionta gluaisteánaíochta agus má dícháilíodh thú ó thiomáint i gCúirt Dúiche, is féidir leat an dícháiliú a achomharc leis an gCúirt Chuarda

source: You must lodge an appeal within 14 days of your conviction
ga: Ní mór duit achomharc a chur isteach laistigh de 14 lá ó dháta do chiontaithe

source: If you wish to represent yourself, the court clerk in your local District Court will help you complete the necessary forms
ga: Más mian leat ionadaíocht a dhéanmh duit féin, cabhróidh an cléireach cúirte i do Chúirt Dúiche áitiúil na foirmeacha riachtanacha a chomhlánú

source: Alternatively, your solicitor can assist you
ga: Mar mhalairt air sin, is féidir leis an dlíodóir cabhrú leat

source: Removal of a disqualification
ga: Deireadh a chur le dícháiliúchán

source: If you have been disqualified from driving and wish to apply to the courts for an early restoration of your licence, you may do so in person or through a solicitor following payment of the appropriate fee.You may apply for the early restoration when half your disqualification period is over
ga: Má dícháilíodh thú ó thiomáint agus más mian leat iarratas a dhéanamh ar na cúirteanna d'athbhronnadh luath do cheadúnais ort, is féidir leat amhlaidh a dhéanamh as do stuaim féin nó trí dhlíodóir i ndiaidh na táillí cuí a íoc. Is féidir leat cur isteach ar athbhronnadh luath do cheadúnais tiomána ort nuair atá leath de do thréimhse dhícháilithe caite

source: However, you cannot apply for an early restoration:
ga: Ach ní féidir leat cur isteach ar athbhronnadh luath:

source: • If the disqualification is for 2 years or less
ga: • Má tá an dícháiliúchán ar feadh dhá bhliain nó níos lú nó

source: • If the disqualification is not your first disqualification order within the previous 10 years
ga: • Más rud é nach bhfuil an dícháiliúchán do ordú dícháiliúcháin chéad laistigh de na 10 mbliana roimhe sin

source: The court can reduce the period of disqualification to two-thirds of the original period of disqualification or to 2 years, whichever is the greater
ga: Is féidir leis an gcúirt an tréimhse dhícháilithe a laghdú go dtí dhá thrian den tréimhse dhícháilithe tosaigh nó go 2 bhliain, cibé acu is mó

source: The court clerk of your District and Circuit Court will tell you about the court venues and dates
ga: Tabharfaidh cléireach cúirte do Chúirte Dúiche agus Cuarda faisnéis duit faoi na hionaid agus na dátaí cúirte

source: The National Driver Licence Service (NDLS) holds your driving licence while you are disqualified
ga: Bíonn do cheadúnas tiomána á choimeád ag an Seirbhís Náisiúnta um Cheadúnais Tiomána (NDLS) nuair a bhíonn tú dícháilithe

source: To get your driving licence back when your period of disqualification expires contact customer service in the NDLS (see below)
ga: D’fhonn do cheadúnas tiomána a fháil ar ais nuair a bhíonn do thréimhse dhícháilithe éagtha, déan teagmháil le seirbhís do chustaiméirí sa NDLS (féach thíos)

source: You will need your PPS number or your driver number
ga: Beidh ort a bheith d'uimhir PSP nó d'uimhir tiománaí

source: You can apply to the NDLS for a copy of your driving licence record
ga: Féadfaidh tú iarratas a dhéanamh ar an NDLS chun cóip a fháil de thaifead do cheadúnais

source: Contact information for your local District Court and contact information for your local Circuit Court is located at the front of all public telephone directories and on the Courts Service website
ga: Tá faisnéis teagmhála do Chúirt Dúiche áitiúla chomh maith le faisnéis teagmhála do Chúirte Cuarda áitiúl ar fáil ag tús an uile eolaí gutháin phoiblí

source: Garda Fixed Charge Processing Office
ga: Oifig Próiseála Muirear Seasta an Gharda Síochána
